{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Cisco",
    "dataSource.vendor": "Cisco",
    "class_uid": "4001",
    "category_uid": "4",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Cisco Networking",
    "metadata.product.vendor_name": "Cisco",
    "metadata.version": "1.1.0",
    "metadata.log_name": "Cisco IOS",
    "type_id": 400100
    "activity_id": 0
  },
  patterns: {
    tsPattern: "\\w{3} \\d{1,2} \\d{2}:\\d{2}:\\d{2}"
  }
  formats: [
    {
      format: "$timestamp=tsPattern$ $serverHost$ %$facility$-$subfacility$-$cisco-severity$-$mnemonic$: $message-text$",
      halt: true,
      rewrites: [
        {
          input: "timestamp",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "mnemonic",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "mnemonic",
          output: "uuid",
          match: ".*",
          replace: "$0"
        }, {
          input: "serverHost",
          output: "src_endpoint.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "0",
          replace: "6"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "1",
          replace: "5"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "2",
          replace: "5"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "4",
          replace: "2"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "5",
          replace: "2"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "6",
          replace: "1"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "7",
          replace: "0"
        }, {
          input: "facility",
          output: "dst_endpoint.name",
          match: ".*",
          replace: "$0"
        }
      ],
    }, {
      format: "$timestamp=tsPattern$ $serverHost$ %$facility$-$cisco-severity$-$mnemonic$: $message-text$",
      halt: true,
      rewrites: [
        {
          input: "timestamp",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "mnemonic",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "mnemonic",
          output: "uuid",
          match: ".*",
          replace: "$0"
        }, {
          input: "serverHost",
          output: "src_endpoint.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "0",
          replace: "6"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "1",
          replace: "5"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "2",
          replace: "5"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "4",
          replace: "2"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "5",
          replace: "2"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "6",
          replace: "1"
        }, {
          input: "cisco-severity",
          output: "severity_id",
          match: "7",
          replace: "0"
        }, {
          input: "facility",
          output: "dst_endpoint.name",
          match: ".*",
          replace: "$0"
        }
      ]
    }
  ]
}
