{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "class_uid": "4001",
    "category_uid": "4",
    "severity_id": "1",
    "severity": "Informational",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Zeek",
    "metadata.version": "1.1.0",
    "metadata.log_name": "conn",
    "app_name": "Zeek"
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "ts",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "uuid",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_h",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_p",
          output: "src_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_h",
          output: "dst_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_p",
          output: "dst_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "proto",
          output: "network_connection_info.protocol_name",
          match: ".*",
          replace: "$0"
        }, {
          input: "service",
          output: "unmapped.application_protocol",
          match: ".*",
          replace: "$0"
        }, {
          input: "orig_bytes",
          output: "traffic.bytes_out",
          match: ".*",
          replace: "$0"
        }, {
          input: "resp_bytes",
          output: "traffic.bytes_in",
          match: ".*",
          replace: "$0"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "S(0|2|3)",
          replace: "4"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "S(0|2|3)",
          replace: "Fail"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "S(0|2|3)",
          replace: "400104"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "S1",
          replace: "1"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "S1",
          replace: "Open"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "S1",
          replace: "400101"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "SF",
          replace: "6"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "SF",
          replace: "Traffic"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "SF",
          replace: "400106"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "REJ",
          replace: "5"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "REJ",
          replace: "Refuse"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "REJ",
          replace: "400105"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "RST*",
          replace: "3"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "RST*",
          replace: "Reset"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "RST*",
          replace: "400103"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "SH*",
          replace: "0"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "SH*",
          replace: "Unknown"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "SH*",
          replace: "400100"
        }, {
          input: "conn_state",
          output: "activity_id",
          match: "OTH",
          replace: "0"
        }, {
          input: "conn_state",
          output: "activity_name",
          match: "OTH",
          replace: "Other"
        }, {
          input: "conn_state",
          output: "type_uid",
          match: "OTH",
          replace: "400199"
        }, {
          input: "local_orig",
          output: "unmapped.local_orig",
          match: ".*",
          replace: "$0"
        }, {
          input: "local_resp",
          output: "unmapped.local_resp",
          match: ".*",
          replace: "$0"
        }, {
          input: "missed_bytes",
          output: "unmapped.missed_bytes",
          match: ".*",
          replace: "$0"
        }, {
          input: "history",
          output: "unmapped.history",
          match: ".*",
          replace: "$0"
        }, {
          input: "orig_pkts",
          output: "traffic.packets_out",
          match: ".*",
          replace: "$0"
        }, {
          input: "orig_ip_bytes",
          output: "unmapped.orig_ip_bytes",
          match: ".*",
          replace: "$0"
        }, {
          input: "resp_pkts",
          output: "traffic.packets_in",
          match: ".*",
          replace: "$0"
        }, {
          input: "resp_ip_bytes",
          output: "unmapped.resp_ip_bytes",
          match: ".*",
          replace: "$0"
        }, {
          input: "tunnel_parents",
          output: "unmapped.tunnel_parents",
          match: ".*",
          replace: "$0"
        }, {
          input: "orig_l2_addr",
          output: "src_endpoint.mac",
          match: ".*",
          replace: "$0"
        }, {
          input: "resp_l2_addr",
          output: "dst_endpiont.mac",
          match: ".*",
          replace: "$0"
        }, {
          input: "vlan",
          output: "dst_endpoint.vlan",
          match: ".*",
          replace: "$0"
        }, {
          input: "inner_vlan",
          output: "unmapped.inner_vlan",
          match: ".*",
          replace: "$0"
        }
      ]
    }
  ]
}