{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "class_uid": "4001",
    "category_uid": "4",
    "severity_id": "1",
    "severity": "Informational",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Corelight",
    "metadata.version": "1.1.0",
    "metadata.log_name": "ssl",
    "app_name": "Zeek"
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "ts",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "uuid",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_h",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_p",
          output: "src_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_h",
          output: "dst_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_p",
          output: "dst_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "version",
          output: "tls.version",
          match: ".*",
          replace: "$0"
        }, {
          input: "cipher",
          output: "tls.cipher",
          match: ".*",
          replace: "$0"
        }, {
          input: "curve",
          output: "unmapped.curve",
          match: ".*",
          replace: "$0"
        }, {
          input: "server_name",
          output: "tls.sni",
          match: ".*",
          replace: "$0"
        }, {
          input: "resumed",
          output: "unmapped.resumed",
          match: ".*",
          replace: "$0"
        }, {
          input: "established",
          output: "activity_id",
          match: ".*",
          replace: "0"
        }, {
          input: "established",
          output: "activity_id",
          match: "true",
          replace: "1"
        }, {
          input: "subject",
          output: "tls.certificate.subject",
          match: "true",
          replace: "1"
        }, {
          input: "issuer",
          output: "tls.certificate.issuer",
          match: "true",
          replace: "1"
        }, {
          input: "cert_chain_fps",
          output: "tls.certificate.fingerprints",
          match: "true",
          replace: "1"
        }, {
          input: "next_protocol",
          output: "unmapped.next_protocol",
          match: "true",
          replace: "1"
        }, {
          input: "ja3",
          output: "tls.ja3_hash",
          match: "true",
          replace: "1"
        }, {
          input: "ja3s",
          output: "tls.ja3s_hash",
          match: "true",
          replace: "1"
        },
      ]
    }
  ]
}