{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "category_uid": "4",
    "category_name": "Network Activity",
    "class_uid": "4002",
    "class_name": "HTTP Activity",
    "severity_id": "1",
    "severity": "Informational",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Corelight",
    "metadata.version": "1.1.0",
    "metadata.log_name": "http",
    "app_name": "Zeek",
    "activity_id": 0
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "ts",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_h",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_p",
          output: "src_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_h",
          output: "dst_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_p",
          output: "dst_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "trans_depth",
          output: "unmapped.trans_depth",
          match: ".*",
          replace: "$0"
        }, {
          input: "method",
          output: "activity_id",
          match: "CONNECT",
          replace: "1"
        }, {
          input: "method",
          output: "type_uid",
          match: "CONNECT",
          replace: "400201"
        }, {
          input: "method",
          output: "activity_id",
          match: "DELETE",
          replace: "2"
        }, {
          input: "method",
          output: "type_uid",
          match: "DELETE",
          replace: "400202"
        }, {
          input: "method",
          output: "activity_id",
          match: "GET",
          replace: "3"
        }, {
          input: "method",
          output: "type_uid",
          match: "GET",
          replace: "400203"
        }, {
          input: "method",
          output: "activity_id",
          match: "HEAD",
          replace: "4"
        }, {
          input: "method",
          output: "type_uid",
          match: "HEAD",
          replace: "400204"
        }, {
          input: "method",
          output: "activity_id",
          match: "OPTIONS",
          replace: "5"
        }, {
          input: "method",
          output: "type_uid",
          match: "OPTIONS",
          replace: "400205"
        },{
          input: "method",
          output: "activity_id",
          match: "POST",
          replace: "6"
        }, {
          input: "method",
          output: "type_uid",
          match: "POST",
          replace: "400206"
        }, {
          input: "method",
          output: "activity_id",
          match: "PUT",
          replace: "7"
        }, {
          input: "method",
          output: "type_uid",
          match: "PUT",
          replace: "400207"
        }, {
          input: "method",
          output: "activity_id",
          match: "TRACE",
          replace: "8"
        }, {
          input: "method",
          output: "type_uid",
          match: "TRACE",
          replace: "400208"
        }, {
          input: "method",
          output: "activity_name",
          match: ".*",
          replace: "$0"
        }, {
          input: "method",
          output: "http_request.http_method",
          match: ".*",
          replace: "$0"
        }, {
          input: "host",
          output: "device.hostname",
          match: ".*",
          replace: "$0"
        }, {
          input: "uri",
          output: "http_request.url.url_string",
          match: ".*",
          replace: "$0"
        }, {
          input: "referrer",
          output: "http_request.referrer",
          match: ".*",
          replace: "$0"
        }, {
          input: "version",
          output: "metadata.version",
          match: ".*",
          replace: "$0"
        }, {
          input: "user_agent",
          output: "http_request.user_agentoc",
          match: ".*",
          replace: "$0"
        }, {
          input: "origin",
          output: "http_request.x_forwarded_for",
          match: ".*",
          replace: "$0"
        }, {
          input: "request_body_len",
          output: "http_request.length",
          match: ".*",
          replace: "$0"
        }, {
          input: "response_body_len",
          output: "http_response.length",
          match: ".*",
          replace: "$0"
        }, {
          input: "status_code",
          output: "http_response.code",
          match: ".*",
          replace: "$0"
        }, {
          input: "status_msg",
          output: "http_response.message",
          match: ".*",
          replace: "$0"
        }, {
          input: "info_code",
          output: "unmapped.info_code",
          match: ".*",
          replace: "$0"
        }, {
          input: "info_msg",
          output: "unmapped.info_msg",
          match: ".*",
          replace: "$0"
        }, {
          input: "tags",
          output: "metadata.labels",
          match: ".*",
          replace: "$0"
        }, {
          input: "username",
          output: "actor.user.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "proxied",
          output: "network_proxy.http_header.value",
          match: ".*",
          replace: "$0"
        }, {
          input: "client_header_names",
          output: "http_request.http_header.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "cookie_vars",
          output: "http_cookie.name",
          match: ".*",
          replace: "$0"
        }, 
      ]
    }
  ]
}