{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "class_uid": "4001",
    "category_uid": "4",
    "severity_id": "1",
    "severity": "Informational",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Zeek",
    "metadata.version": "1.1.0",
    "metadata.log_name": "tunnel",
    "app_name": "Zeek"
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "ts",
          output: "time",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "metadata.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "uid",
          output: "uuid",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_h",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.orig_p",
          output: "src_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_h",
          output: "dst_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "id.resp_p",
          output: "dst_endpoint.port",
          match: ".*",
          replace: "$0"
        }, {
          input: "action",
          output: "activity_id",
          match: ".*DISCOVER",
          replace: "1"
        }, {
          input: "action",
          output: "activity_name",
          match: ".*DISCOVER",
          replace: "Open"
        }, {
          input: "action",
          output: "type_uid",
          match: ".*DISCOVER",
          replace: "400101"
        }, {
          input: "action",
          output: "activity_id",
          match: ".*CLOSE",
          replace: "2"
        }, {
          input: "action",
          output: "activity_name",
          match: ".*CLOSE",
          replace: "Close"
        }, {
          input: "action",
          output: "type_uid",
          match: ".*CLOSE",
          replace: "400102"
        }, {
          input: "tunnel_type",
          output: "unmapped.tunnel_type",
          match: ".*:(.*)",
          replace: "$1"
        }
      ]
    }
  ]
}