{
  attributes: {
    "category_name": "Findings",
    "category_uid": "2",
    "class_uid": "2004",
    "class_name": "Detection Finding",
    "metadata.version": "1.1.0",
    "status_id": "0",
    "status": "Unknown",
    "dataSource.name": "Singularity Identity",
    "dataSource.category": "security",
    "dataSource.vendor": "SentinelOne",
  },
  formats: [
    {
      attributes: {
        "activity_name": "Alert",
        "activity_id": "99",
        "event.type": "Alert",
        "type_name": "Detection Finding: Other",
        "type_uid": "200499",
        "finding_info.analytic.type": "Rule",
        "finding_info.analytic.type_id": "1"
      }
      format: ".*\\{\"alert\"\\:\\{\"src-ip\"\\:.*\\,\"attivo_uid\"\\:(\"|)$finding_info.uid$(\"|)\\,\"Description\"\\:(\"|)$finding_info.title$(\"|)\\,\"mitre_tactic\"\\:.*\\,\"serviceAccounts\"\\:(\"|)$unmapped.alert.serviceAccounts$(\"|)\\,\"Alert_Level_Str\"\\:\"$unmapped.severity$\"\\,\"src-port\"\\:.*\\,\"Product\"\\:(\"|)$metadata.product.name$(\"|)\\,\"feature\"\\:(\"|)$metadata.product.feature.name$(\"|)\\,\"privilegeAccounts\"\\:(\"|)$unmapped.alert.privilegeAccounts$(\"|)\\,\"details\"\\:(\"|)$finding_info.desc$(\"|)\\,\"Identity\"\\:(\"|)$unmapped.alert.Identity$(\"|)\\,\"dest_port\"\\:.*\\,\"src_mac\"\\:.*\\,\"mitre_tech\"\\:.*\\,\"neverExpireAccounts\"\\:(\"|)$unmapped.alert.neverExpireAccounts$(\"|)\\,\"subscriberId\"\\:(\"|)$unmapped.alert.subscriberId$(\"|)\\,\"mitre_tech_id\"\\:.*\\,\"Vendor\"\\:(\"|)$metadata.product.vendor_name$(\"|)\\,\"Type\"\\:(\"|)$finding_info.types$(\"|)\\,\"dest_os\"\\:.*\\,\"@timestamp\"\\:(\"|)$timestamp$(\"|)\\,\"subscriberName\"\\:(\"|)$unmapped.alert.subscriberName$(\"|)\\,\"dest_ip\"\\:.*\\,\"Rule\"\\:(\"|)$finding_info.analytic.uid$(\"|)\\,\"totalAccounts\"\\:(\"|)$unmapped.alert.totalAccounts$(\"|)\\}\\,\"retry\"\\:(\"|)$unmapped.retry$(\"|)\\}"
      halt: true,
      rewrites: [
        {
          input:   "finding_info.types", 
          output:  "finding_info.types",
          match:   ".*",
          replace: "[\"$0\"]"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^(?!Very High|High|Medium|Low|Very Low$).*",
          replace: "99"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^Very Low$",
          replace: "1"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^Low$",
          replace: "2"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^Medium$",
          replace: "3"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^High$",
          replace: "4"
        },
        {
          input:   "unmapped.severity", 
          output:  "severity_id",
          match:   "^Very High$",
          replace: "5"
        },
        {
          input:   "message", 
          output:  "evidences",
          match:   ".*src-ip\"\\:(.*?),.*src-port\"\\:(.*?),.*dest_port\"\\:(.*?),.*src_mac\"\\:(.*?),.*dest_os\"\\:(.*?),.*dest_ip\"\\:(.*?),.*",
          replace: "\\[\\{\"src_endpoint\"\\: \\{\"ip\"\\: $1, \"port\"\\: $2\\, \"mac\"\\: $4\\}\\, \"dst_endpoint\"\\: \\{\"port\"\\: $3\\, \"os\"\\: \\{\"name\"\\: $5\\}, \"ip\"\\: $6\\}\\}\\]"
        },
        {
          input: "message",
          output: "attacks",
          match: ".*mitre_tactic\"\\:(.*?),.*mitre_tech\"\\:(.*?),.*mitre_tech_id\"\\:(.*?),.*"
          replace: "\\[\\{\"tactic\"\\: \\{\"name\"\\: $1\\}\\, \"technique\"\\: \\{\"name\"\\: $2\\, \"uid\"\\: $3\\}\\}\\]"
        },
        {
          input: "message",
          output: "observables",
          match: ".*subscriberId\"\\:(.*?),.*subscriberName\"\\:(.*?),.*"
          replace: "\\[\\{\"type_id\"\\: 99, \"type\"\\: \"subscriberId\"\\, \"name\"\\: \"unmapped.alert.subscriberId\"\\, \"value\"\\: $1\\}\\, {\"type_id\"\\: 99, \"type\"\\: \"subscriberName\"\\, \"name\"\\: \"unmapped.alert.subscriberName\"\\, \"value\"\\: $2\\}\\]"
        }
      ]
    },
    {
      attributes: {
        "activity_name": "Event",
        "activity_id": "99",
        "event.type": "Event",
        "type_name": "Detection Finding: Other",
        "type_uid": "200499",
        "severity_id": "0",
        "unmapped.severity": "Unknown",

      }
      format: ".*\\{\"alert\"\\:(\"|)$unmapped.alert$(\"|)\\,\"event\"\\:\\{\"featuretype\"\\:(\"|)$metadata.product.feature.name$(\"|)\\,\"_id\"\\:(\"|)$metadata.uid$(\"|)\\,\"acknowledged\"\\:(\"|)$unmapped.event.acknowledged$(\"|)\\,\"username\"\\:(\"|)$actor.user.name$(\"|)\\,\"networkInterfaces\"\\:.*\\,\"queryData\"\\:(\"|)$unmapped.event.queryData$(\"|)\\,\"querytype.raw\"\\:(\"|)$unmapped.event.querytype.raw$(\"|)\\,\"guid_usersid\"\\:(\"|)$actor.user.uid_alt$(\"|)\\,\"usersid\"\\:(\"|)$actor.user.uid$(\"|)\\,\"admin.raw\"\\:(\"|)$unmapped.admin.raw$(\"|)\\,\"hostname\"\\:.*\\,\"root_process_name\"\\:(\"|)$actor.process.name$(\"|)\\,\"Binary Tree\"\\:.*\\,\"eventids\"\\:.*\\,\"hostos.raw\"\\:(\"|)$device.hostname$(\"|)\\,\"provider.raw\"\\:(\"|)$metadata.log_provider$(\"|)\\,\"clientgroupid.raw\"\\:.*\\,\"prfileName\"\\:.*\\,\"SHA2\"\\:.*\\,\"time\"\\:(\"|)$timestamp$(\"|)\\,\"arguments\"\\:(\"|)$actor.process.cmd_line$(\"|)\\,\"subscriberId\"\\:(\"|)$unmapped.event.subscriberId$(\"|)\\,\"attivo_uid\"\\:(\"|)$finding_info.uid$(\"|)\\}\\,\"retry\"\\:(\"|)$unmapped.retry$(\"|)\\}.*"
      halt: true,
      rewrites: [
        {
          input:   "unmapped.admin.raw", 
          output:  "actor.user.type",
          match:   ".*(?!Yes).*",
          replace: "User"
        },
        {
          input:   "unmapped.admin.raw", 
          output:  "actor.user.type",
          match:   ".*Yes.*",
          replace: "Admin"
        },
        {
          input:   "unmapped.admin.raw", 
          output:  "actor.user.type_id",
          match:   ".*(?!Yes).*",
          replace: "1"
        },
        {
          input:   "unmapped.admin.raw", 
          output:  "actor.user.type_id",
          match:   ".*Yes.*",
          replace: "2"
        },
        {
          input: "message",
          output: "device.network_interfaces",
          match: ".*networkInterfaces\"\\:\\[\\{\"name\":(.*?)\\,\"subnet\"\\:\".*/(.*?)\\,\"ipAddress\"\\:(.*?)\\,.*\"macAddress\"\\:(.*?)\\,.*\"type\"\\:(.*?)\\}\\]\\,.*"
          replace: "\\[\\{\"name\"\\: $1\\, \"subnet_prefix\"\\: $2, \"ip\"\\: $3, \"mac\"\\: $4, \"type\"\\: $5\\}\\]"
        },
        {
          input: "message",
          output: "evidences",
          match: ".*hostname\"\\:(.*?)\\,.*Binary Tree\"\\:\\[(.*?)\\]\\,.*prfileName\"\\:(.*?)\\,.*SHA2\"\\:(.*?)\\,.*"
          replace: "\\[\\{\"src_endpoint\"\\: \\{\"hostname\"\\: $1\\}\\, \"data\"\\: $2\\, \"file\"\\: \\{\"name\"\\: $3, \"hashes\"\\: \\[\\{\"algorithm_id\"\\: 99\\, \"algorithm\"\\: \"SHA2\"\\, \"value\"\\: $4\\}\\]\\}\\}\\]"
        },
        {
          input: "message",
          output: "metadata.loggers",
          match: ".*eventids\"\\:(.*?)\\,.*"
          replace: "\\[\\{\"uid\"\\: $1\\}\\]"
        },
        {
          input: "message",
          output: "device.groups",
          match: ".*clientgroupid.raw\"\\:(.*?)\\,.*"
          replace: "\\[\\{\"uid\"\\: $1\\}\\]"
        },
        {
          input: "message",
          output: "observables",
          match: ".*subscriberId\"\\:(.*?),.*"
          replace: "\\[\\{\"type_id\"\\: 99, \"type\"\\: \"subscriberId\"\\, \"name\"\\: \"unmapped.event.subscriberId\"\\, \"value\"\\: $1\\}\\]"
        }
      ]
    },
    {
      attributes: {
        "activity_name": "Alert",
        "activity_id": "99",
        "event.type": "Alert",
        "type_name": "Detection Finding: Other",
        "type_uid": "200499",
        "finding_info.analytic.type": "Rule",
        "finding_info.analytic.type_id": "1"
      }
      format: "${parse=dottedJson}$"
      halt: true,
       rewrites: [
        {
          input:   "alert.Identity", 
          output:  "unmapped.alert.Identity",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.attivo_uid", 
          output:  "finding_info.uid",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Description", 
          output:  "finding_info.title",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Product", 
          output:  "metadata.product.name",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.feature", 
          output:  "metadata.product.feature.name",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.details", 
          output:  "finding_info.desc",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Vendor", 
          output:  "metadata.product.vendor_name",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Type", 
          output:  "finding_info.types",
          match:   ".*",
          replace: "[\"$0\"]"
        },
        {
          input:   "alert.user_name", 
          output:  "actor.user.full_name",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.ad_events_ids", 
          output:  "metadata.uid",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.process_name", 
          output:  "actor.process.name",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.adDomain", 
          output:  "device.domain",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.reference_id", 
          output:  "metadata.correlation_uid",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^(?!Very High|High|Medium|Low|Very Low$).*",
          replace: "Other"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^Very Low$",
          replace: "Informational"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^Low$",
          replace: "Low"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^Medium$",
          replace: "Medium"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^High$",
          replace: "High"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "unmapped.severity",
          match:   "^Very High$",
          replace: "Critical"
        }, 
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^(?!Very High|High|Medium|Low|Very Low$).*",
          replace: "99"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^Very Low$",
          replace: "1"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^Low$",
          replace: "2"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^Medium$",
          replace: "3"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^High$",
          replace: "4"
        },
        {
          input:   "alert.Alert_Level_Str", 
          output:  "severity_id",
          match:   "^Very High$",
          replace: "5"
        },
        {
          input:   "alert.@timestamp", 
          output:  "timestamp",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.serviceAccounts", 
          output:  "unmapped.alert.serviceAccounts",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.privilegeAccounts", 
          output:  "unmapped.alert.privilegeAccounts",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.neverExpireAccounts", 
          output:  "unmapped.alert.neverExpireAccounts",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.assessmentId", 
          output:  "unmapped.alert.assessmentId",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.forwarder", 
          output:  "unmapped.alert.forwarder",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.subscriberId", 
          output:  "unmapped.alert.subscriberId",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.subscriberName", 
          output:  "unmapped.alert.subscriberName",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.dest_ip_port", 
          output:  "unmapped.alert.dest_ip_port",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.forwarder_ip", 
          output:  "unmapped.alert.forwarder_ip",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "event", 
          output:  "unmapped.event",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.Rule", 
          output:  "finding_info.analytic.uid",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "alert.totalAccounts", 
          output:  "unmapped.alert.totalAccounts",
          match:   ".*",
          replace: "$0"
        },
        {
          input:   "retry", 
          output:  "unmapped.retry",
          match:   ".*",
          replace: "$0"
        },
        {
          input: "message",
          output: "evidences",
          match: ".*src_ep_guid\"\\:(.*?),.*attDomain\"\\:(.*?),.*vlanId\"\\:(.*?),.*src_hostname\"\\:(.*?),.*src-ip\"\\:(.*?),.*src-port\"\\:(.*?),.*src_os_name\"\\:(.*?),.*src_mac\"\\:(.*?),.*src_os_type\"\\:(.*?),.*dest_host\"\\:(.*?),.*dest_ip\"\\:(.*?),.*dest_os\"\\:(.*?),.*dest_port\"\\:(.*?),.*dest_ip_list\"\\:(.*?),.*dest_username\"\\:(.*?),.*dest_mac\"\\:(.*?),.*ap_json\"\\:(.*?),.*"
          replace: "\\[\\{\"src_endpoint\"\\: \\{\"uid\"\\: $1, \"domain\"\\: $2\\, \"vlan_uid\"\\: $3\\, \"hostname\"\\: $4\\, \"ip\"\\: $5\\, \"port\"\\: $6\\, \"os\"\\: \\{\"name\"\\: $7\\, \"type\"\\: $9\\}, \"mac\"\\: $8\\}\\, \"dst_endpoint\"\\: \\{\"hostname\"\\: $10\\, \"ip\"\\: $11\\, \"os\"\\: \\{\"name\"\\: $12\\}\\, \"port\"\\: $13\\, \"intermediate_ips\"\\: $14\\, \"name\"\\: $15\\, \"mac\"\\: $16\\}\\, \"data\"\\: $17\\}\\]"
        },
        {
          input: "message",
          output: "attacks",
          match: ".*mitre_tactic\"\\:(.*?),.*mitre_tech\"\\:(.*?),.*mitre_tech_id\"\\:(.*?),.*"
          replace: "\\[\\{\"tactic\"\\: \\{\"name\"\\: $1\\}\\, \"technique\"\\: \\{\"name\"\\: $2\\, \"uid\"\\: $3\\}\\}\\]"
        },
        {
          input: "message",
          output: "observables",
          match: ".*subscriberName\"\\:(.*?),.*subscriberId\"\\:(.*?),.*forwarder_ip\"\\:(.*?),.*"
          replace: "\\[\\{\"type_id\"\\: 1, \"type\"\\: \"IP Address\"\\, \"name\"\\: \"unmapped.alert.forwarder_ip\"\\, \"value\"\\: $3\\}\\, \\{\"type_id\"\\: 99, \"type\"\\: \"subscriberName\"\\, \"name\"\\: \"unmapped.alert.subscriberName\"\\, \"value\"\\: $1\\}\\, \\{\"type_id\"\\: 99, \"type\"\\: \"subscriberId\"\\, \"name\"\\: \"unmapped.alert.subscriberId\"\\, \"value\"\\: $2\\}\\]"
        }
       ]
    }
  ]
}
