{
  // this parser uses Vectra AI syslogs in JSON format; reference: https://support.vectra.ai/s/article/KB-VS-1233
  // specify a time zone if the timestamps not using default UTC
  // timezone: "GMT-0800"
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Vectra AI",
    "dataSource.vendor": "Vectra AI",
    "severity_id": "1",
    "severity": "Informational",
    "metadata.product.name": "Vectra AI",
    "metadata.product.vendor_name": "Vectra AI",
    "metadata.version": "1.1.0",
    "metadata.log_name": "Scoring",
    "app_name": "Cognito Brain",
    "activity_id": 0
  },
  patterns: {
    tsPattern: "\\w+\\s+\\d+\\s+\\d{1,2}:\\d{1,2}:\\d{1,2}"
  },
  formats: [
    {
      id: "account",
      format: "<\\d+>$timestamp=tsPattern$ $vsensor$ vectra_json_account -: ${parse=dottedJson}$",
      halt: true,
      halt: true,
      attributes: {
        "category_uid": "2",
        "category_name": "Findings",
        "class_uid": "2004",
        "class_name": "Detection Finding",
        "activity_id": 2,
        "severity_id": 99,
        "severity": "Other",
        "type_uid": 200402
      },
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "certainty",
          output: "confidence_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "account_uid",
          output: "actor.user.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "account_uid",
          output: "actor.user.email_addr",
          match: "(\\w+):(\\S+)",
          replace: "$2"
        }, {
          input: "threat",
          output: "impact_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "category",
          output: "finding_info.title",
          match: ".*",
          replace: "$0"
        }, {
          input: "href",
          output: "finding_info.src_url",
          match: ".*",
          replace: "$0"
        }, {
          input: "vectra_timestamp",
          output: "finding_info.modified_time",
          match: ".*",
          replace: "$0"
        }
      ]
    }, {
      id: "account_detection"
      format: "<\\d+>$timestamp=tsPattern$ $vsensor$ vectra_json_account_detection -: ${parse=dottedJson}$",
      halt: true,
      halt: true,
      attributes: {
        "category_uid": "2",
        "category_name": "Findings",
        "class_uid": "2004",
        "class_name": "Detection Finding",
        "activity_id": 2,
        "severity_id": 99,
        "severity": "Other",
        "type_uid": 200402
      },
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "certainty",
          output: "confidence_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "account_uid",
          output: "actor.user.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "account_uid",
          output: "actor.user.email_addr",
          match: "(\\w+):(\\S+)",
          replace: "$1"
        }, {
          input: "host_id",
          output: "src_endpoint.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "host_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "host_name",
          output: "src_endpoint.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "threat",
          output: "impact_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "category",
          output: "finding_info.title",
          match: ".*",
          replace: "$0"
        }, {
          input: "href",
          output: "finding_info.src_url",
          match: ".*",
          replace: "$0"
        }, {
          input: "vectra_timestamp",
          output: "finding_info.modified_time",
          match: ".*",
          replace: "$0"
        }
      ]
    }, {
      id: "system_health"
      format: "<\\d+>$timestamp=tsPattern$ $vsensor$ vectra_json_health -: ${parse=dottedJson}$",
      halt: true,
      attributes: {
        "category_uid": "5",
        "category_name": "Discovery",
        "class_uid": "5019",
        "class_name": "Device Config State Change",
        "activity_id": 1,
        "severity_id": 99,
        "severity": "Other",
        "type_uid": 501999
      },
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "source_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "dvchost",
          output: "device.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "headend_addr",
          output: "device.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "source_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "result",
          output: "status_code",
          match: ".*",
          replace: "$0"
        }, {
          input: "message_",
          output: "status_detail",
          match: ".*",
          replace: "$0"
        },
      ]
    }, {
      id: "audit"
      format: "<\\d+>$timestamp=tsPattern$ $vsensor$ vectra_json_audit -: ${parse=dottedJson}$",
      halt: true,
      attributes: {
        "category_uid": "5",
        "category_name": "Discovery",
        "class_uid": "5019",
        "class_name": "Device Config State Change",
        "activity_id": 1,
        "severity_id": 99,
        "severity": "Other",
        "type_uid": 501999
      },
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "source_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "dvchost",
          output: "device.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "headend_addr",
          output: "device.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "source_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "result",
          output: "status_code",
          match: ".*",
          replace: "$0"
        }, {
          input: "message_",
          output: "status_detail",
          match: ".*",
          replace: "$0"
        }, {
          input: "user",
          output: "actor.user.account",
          match: ".*",
          replace: "$0"
        }
      ]
    }, {
      id: "scoring"
      format: "<\\d+>$timestamp=tsPattern$ $vsensor$ vectra_json -: ${parse=dottedJson}$",
      halt: true,
      attributes: {
        "category_uid": "2",
        "category_name": "Findings",
        "class_uid": "2004",
        "class_name": "Detection Finding",
        "activity_id": 2,
        "severity_id": 99,
        "severity": "Other",
        "type_uid": 200402
      },
      rewrites: [
        {
          input: "ts",
          output: "timestamp",
          match: ".*",
          replace: "$0"
        }, {
          input: "certainty",
          output: "confidence_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "host_id",
          output: "src_endpoint.uid",
          match: ".*",
          replace: "$0"
        }, {
          input: "host_ip",
          output: "src_endpoint.ip",
          match: ".*",
          replace: "$0"
        }, {
          input: "host_name",
          output: "src_endpoint.name",
          match: ".*",
          replace: "$0"
        }, {
          input: "threat",
          output: "impact_score",
          match: ".*",
          replace: "$0"
        }, {
          input: "category",
          output: "finding_info.title",
          match: ".*",
          replace: "$0"
        }, {
          input: "href",
          output: "finding_info.src_url",
          match: ".*",
          replace: "$0"
        }, {
          input: "vectra_timestamp",
          output: "finding_info.modified_time",
          match: ".*",
          replace: "$0"
        }
      ]
    },
  ]
}
